postgrest/RESULTS_SELECT_ONLY.txt
# pgrbench-all-pg-instances repeat 3 pgrbench-pgbench-varied-clients -b select-only > RESULTS_SELECT_ONLY.txt

Instance: m5a.large


Run: 1


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 263519
latency average = 1.139 ms
tps = 8782.200873 (including connections establishing)
tps = 8784.747544 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 623693
latency average = 2.407 ms
tps = 20775.682993 (including connections establishing)
tps = 20795.340494 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 545068
latency average = 5.515 ms
tps = 18133.180798 (including connections establishing)
tps = 18156.344046 (excluding connections establishing)

Run: 2


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 739786
latency average = 0.406 ms
tps = 24656.278556 (including connections establishing)
tps = 24664.928204 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 648094
latency average = 2.315 ms
tps = 21595.137800 (including connections establishing)
tps = 21611.757913 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 544921
latency average = 5.510 ms
tps = 18147.760500 (including connections establishing)
tps = 18170.434677 (excluding connections establishing)

Run: 3


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 757834
latency average = 0.396 ms
tps = 25260.574896 (including connections establishing)
tps = 25270.101103 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 652519
latency average = 2.299 ms
tps = 21747.162676 (including connections establishing)
tps = 21764.020683 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 543228
latency average = 5.531 ms
tps = 18080.812965 (including connections establishing)
tps = 18104.822396 (excluding connections establishing)

Instance: m5a.xlarge


Run: 1


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 314232
latency average = 0.955 ms
tps = 10470.840152 (including connections establishing)
tps = 10472.812847 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 1231591
latency average = 1.218 ms
tps = 41035.902356 (including connections establishing)
tps = 41063.526391 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 1051776
latency average = 2.855 ms
tps = 35030.677043 (including connections establishing)
tps = 35058.991608 (excluding connections establishing)

Run: 2


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1027410
latency average = 0.292 ms
tps = 34231.058871 (including connections establishing)
tps = 34238.286346 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 1225883
latency average = 1.224 ms
tps = 40848.878544 (including connections establishing)
tps = 40876.650149 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 1049145
latency average = 2.864 ms
tps = 34915.071731 (including connections establishing)
tps = 34948.526833 (excluding connections establishing)

Run: 3


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1024073
latency average = 0.293 ms
tps = 34135.181026 (including connections establishing)
tps = 34142.887509 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 1248577
latency average = 1.202 ms
tps = 41606.750685 (including connections establishing)
tps = 41634.600256 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 1044513
latency average = 2.876 ms
tps = 34768.903186 (including connections establishing)
tps = 34798.480241 (excluding connections establishing)

Instance: m5a.2xlarge


Run: 1


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 355941
latency average = 0.843 ms
tps = 11864.513575 (including connections establishing)
tps = 11865.981346 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 2776907
latency average = 0.541 ms
tps = 92497.870643 (including connections establishing)
tps = 92518.287566 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 2273518
latency average = 1.320 ms
tps = 75749.569660 (including connections establishing)
tps = 75780.614343 (excluding connections establishing)

Run: 2


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1233558
latency average = 0.243 ms
tps = 41117.726262 (including connections establishing)
tps = 41122.683238 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 2783632
latency average = 0.539 ms
tps = 92742.293381 (including connections establishing)
tps = 92769.098512 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 2237889
latency average = 1.342 ms
tps = 74525.654608 (including connections establishing)
tps = 74556.470291 (excluding connections establishing)

Run: 3


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1198431
latency average = 0.250 ms
tps = 39946.959453 (including connections establishing)
tps = 39951.728156 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 2781743
latency average = 0.539 ms
tps = 92691.961390 (including connections establishing)
tps = 92722.945313 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 2234372
latency average = 1.344 ms
tps = 74385.941941 (including connections establishing)
tps = 74414.385027 (excluding connections establishing)

Instance: m5a.4xlarge


Run: 1


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 330781
latency average = 0.907 ms
tps = 11025.846534 (including connections establishing)
tps = 11027.081763 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 4390150
latency average = 0.342 ms
tps = 146232.948176 (including connections establishing)
tps = 146253.703773 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 5427001
latency average = 0.553 ms
tps = 180772.556793 (including connections establishing)
tps = 180806.662219 (excluding connections establishing)

Run: 2


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1092365
latency average = 0.275 ms
tps = 36407.497768 (including connections establishing)
tps = 36412.016799 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 4393219
latency average = 0.341 ms
tps = 146412.898445 (including connections establishing)
tps = 146434.448239 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 5458025
latency average = 0.550 ms
tps = 181806.730324 (including connections establishing)
tps = 181850.060708 (excluding connections establishing)

Run: 3


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1121409
latency average = 0.268 ms
tps = 37379.404312 (including connections establishing)
tps = 37383.845709 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 4398065
latency average = 0.341 ms
tps = 146532.539323 (including connections establishing)
tps = 146553.676773 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 5435141
latency average = 0.552 ms
tps = 181073.495555 (including connections establishing)
tps = 181115.333951 (excluding connections establishing)

Instance: m5a.8xlarge


Run: 1


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 338696
latency average = 0.886 ms
tps = 11288.184721 (including connections establishing)
tps = 11289.532964 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 4487167
latency average = 0.334 ms
tps = 149506.410664 (including connections establishing)
tps = 149526.344752 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 6923572
latency average = 0.434 ms
tps = 230591.580119 (including connections establishing)
tps = 230631.736084 (excluding connections establishing)

Run: 2


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1095002
latency average = 0.274 ms
tps = 36499.458709 (including connections establishing)
tps = 36503.965426 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 4524836
latency average = 0.332 ms
tps = 150824.016265 (including connections establishing)
tps = 150847.750303 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 6885917
latency average = 0.436 ms
tps = 229341.334899 (including connections establishing)
tps = 229382.831300 (excluding connections establishing)

Run: 3


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 10
number of threads: 10
duration: 30 s
number of transactions actually processed: 1075219
latency average = 0.279 ms
tps = 35839.957576 (including connections establishing)
tps = 35844.571538 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 50
number of threads: 16
duration: 30 s
number of transactions actually processed: 4420150
latency average = 0.339 ms
tps = 147290.948814 (including connections establishing)
tps = 147312.187141 (excluding connections establishing)


transaction type: <builtin: select only>
scaling factor: 50
query mode: prepared
number of clients: 100
number of threads: 16
duration: 30 s
number of transactions actually processed: 6830556
latency average = 0.440 ms
tps = 227528.201893 (including connections establishing)
tps = 227567.650969 (excluding connections establishing)